# frozen_string_literal: true

# vim: ft=brewfile

tap 'homebrew/bundle'
tap 'homebrew/services'

# Build Environment/C/C++
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'gcc'
brew 'gnutls'
brew 'glances'
brew 'make'
brew 'pkg-config'

# Everything Else
brew 'bash-completion@2'
brew 'cloc'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'fzf'
brew 'gawk'
brew 'gh'
brew 'git'
brew 'git-secrets'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gpgme'
brew 'grc'
brew 'grep'
brew 'haproxy'
brew 'htop'
brew 'jemalloc'
brew 'jq'
brew 'libgpg-error'
brew 'libheif'
brew 'libmemcached'
brew 'libpng'
brew 'libpq'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'libzip'
brew 'libvips'
brew 'make'
brew 'memcached'
brew 'ncurses'
brew 'nginx'
brew 'openjdk@17'
brew 'p7zip'
brew 'parallel'
brew 'python3'
brew 'pcre'
brew 'pstree'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ripgrep'
brew 'rsync'
brew 'ruby-build'
brew 'ruby-completion'
brew 'shellcheck'
brew 'shfmt'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yamlfmt'
brew 'yamllint'
brew 'ydiff'
brew 'yq'
brew 'zlib'

cask "github"
cask "chromedriver"
cask "font-awesome-terminal-fonts"
cask "font-cairo"
cask "font-cascadia-mono"
cask "font-consolas-for-powerline"
cask "font-cousine"
cask "font-d2coding"
cask "font-fantasque-sans-mono"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-lekton-nerd-font"
cask "font-powerline-symbols"
cask "font-pt-mono"
cask "font-roboto"
cask "font-roboto-mono-nerd-font"
cask "font-titillium"
cask "font-ubuntu"
